{
  "task_groups": {
    "latam_pr": {
      "name": "Portuguese LATAM",
      "description": "Portuguese language tasks for Latin America",
      "description_en": "Portuguese language tasks for Latin America",
      "description_es": "Tareas en portugués para América Latina",
      "description_pt": "Tarefas em português para a América Latina",
      "long_description": "Suite of selected tasks from the Portuguese LATAM group designed to evaluate the performance of models in the Portuguese language. Based on the work of the Open Portuguese LLM Leaderboard, these tasks were carefully selected to measure the capabilities of language models in understanding Portuguese. The tasks cover a wide range of linguistic abilities, from basic comprehension to complex reasoning in Portuguese. The evaluation suite includes tasks like ASSIN2 for textual entailment and semantic similarity, BLUEX for university entrance exams, and ENEM for standardized testing comprehension. This comprehensive set of benchmarks helps assess how well language models can process and generate Portuguese text across different contexts and difficulty levels.",
      "long_description_en": "Suite of selected tasks from the Portuguese LATAM group designed to evaluate the performance of models in the Portuguese language. Based on the work of the Open Portuguese LLM Leaderboard, these tasks were carefully selected to measure the capabilities of language models in understanding Portuguese. The tasks cover a wide range of linguistic abilities, from basic comprehension to complex reasoning in Portuguese. The evaluation suite includes tasks like ASSIN2 for textual entailment and semantic similarity, BLUEX for university entrance exams, and ENEM for standardized testing comprehension. This comprehensive set of benchmarks helps assess how well language models can process and generate Portuguese text across different contexts and difficulty levels.",
      "long_description_es": "Conjunto de tareas seleccionadas del grupo LATAM en portugués, diseñado para evaluar el desempeño de los modelos en dicho idioma. Basado en el trabajo del Open Portuguese LLM Leaderboard, estas tareas fueron cuidadosamente elegidas para medir la capacidad de los modelos de lenguaje para comprender el portugués. Cubren un amplio espectro de habilidades, desde comprensión básica hasta razonamiento complejo. La suite incluye ASSIN2 para inferencia textual y similitud semántica, BLUEX para exámenes de ingreso a la universidad y ENEM para comprensión en pruebas estandarizadas. Este conjunto permite evaluar cómo los modelos procesan y generan texto en portugués en distintos contextos y niveles de dificultad.",
      "long_description_pt": "Conjunto de tarefas selecionadas do grupo LATAM em português, projetado para avaliar o desempenho dos modelos no idioma. Com base no Open Portuguese LLM Leaderboard, essas tarefas foram escolhidas para medir a capacidade dos modelos de compreender o português. As tarefas cobrem desde compreensão básica até raciocínio complexo. A suíte inclui ASSIN2 para inferência textual e similaridade semântica, BLUEX para vestibulares e ENEM para compreensão em exames padronizados. Esse conjunto avalia como os modelos processam e geram texto em português em diversos contextos e níveis de dificuldade.",
      "repository": "https://github.com/surus-lat/portuguese-bench",
      "subtasks": [
        "assin2_rte",
        "assin2_sts",
        "bluex",
        "enem_challenge",
        "oab_exams"
      ]
    },
    "latam_es": {
      "name": "Spanish LATAM",
      "description": "Spanish language tasks for Latin America",
      "description_en": "Spanish language tasks for Latin America",
      "description_es": "Tareas en español para América Latina",
      "description_pt": "Tarefas em espanhol para a América Latina",
      "long_description": "Suite of selected tasks from the Spanish Bench available in the lm-evaluation-harness from the team at IberoBench (https://aclanthology.org/2025.coling-main.699/) and SomosNLP's Spanish Leaderboard (https://github.com/somosnlp/lm-evaluation-harness) designed to evaluate the performance of models in the Spanish language. The tasks cover a wide range of linguistic abilities, from basic comprehension to complex reasoning in Spanish. The evaluation suite includes tasks like COPA for choice of plausible alternatives, ESCOLA for Spanish Corpus of Linguistic Acceptability, MGSM for Multilingual Grade School Math, OpenBookQA for open-domain question answering, PAWS for paraphrase adversaries from word scrambling, TELEIA for Teleia Spanish language assessment, WNLI for Winograd Natural Language Inference, and XNLI for Cross-lingual Natural Language Inference. This comprehensive set of benchmarks helps assess how well language models can process and generate Spanish text across different contexts and difficulty levels.",
      "long_description_en": "Suite of selected tasks from the Spanish Bench available in the lm-evaluation-harness from the team at IberoBench (https://aclanthology.org/2025.coling-main.699/) and SomosNLP's Spanish Leaderboard (https://github.com/somosnlp/lm-evaluation-harness) designed to evaluate the performance of models in the Spanish language. The tasks cover a wide range of linguistic abilities, from basic comprehension to complex reasoning in Spanish. The evaluation suite includes tasks like COPA for choice of plausible alternatives, ESCOLA for Spanish Corpus of Linguistic Acceptability, MGSM for Multilingual Grade School Math, OpenBookQA for open-domain question answering, PAWS for paraphrase adversaries from word scrambling, TELEIA for Teleia Spanish language assessment, WNLI for Winograd Natural Language Inference, and XNLI for Cross-lingual Natural Language Inference. This comprehensive set of benchmarks helps assess how well language models can process and generate Spanish text across different contexts and difficulty levels.",
      "long_description_es": "Conjunto de tareas seleccionadas del Spanish Bench del lm-evaluation-harness del equipo de IberoBench (https://aclanthology.org/2025.coling-main.699/) y del Spanish Leaderboard de SomosNLP (https://github.com/somosnlp/lm-evaluation-harness), diseñado para evaluar el desempeño de modelos en lengua española. Cubre habilidades desde comprensión básica hasta razonamiento complejo. Incluye COPA (elección de alternativas plausibles), EsCoLA (aceptabilidad lingüística), MGSM (matemática escolar multilingüe), OpenBookQA (preguntas de ciencia de dominio abierto), PAWS (paráfrasis con alta superposición léxica), TELEIA (evaluación del español), WNLI (inferencia Winograd) y XNLI (inferencia multilingüe). Este conjunto permite medir cómo los modelos procesan y generan texto en español en diversos contextos y niveles de dificultad.",
      "long_description_pt": "Conjunto de tarefas selecionadas do Spanish Bench no lm-evaluation-harness da equipe IberoBench (https://aclanthology.org/2025.coling-main.699/) e do Spanish Leaderboard da SomosNLP (https://github.com/somosnlp/lm-evaluation-harness), projetado para avaliar o desempenho de modelos em língua espanhola. Cobre habilidades desde compreensão básica até raciocínio complexo. Inclui COPA (escolha de alternativas plausíveis), EsCoLA (aceitabilidade linguística), MGSM (matemática escolar multilíngue), OpenBookQA (perguntas de ciência de domínio aberto), PAWS (paráfrases com alta sobreposição lexical), TELEIA (avaliação do espanhol), WNLI (inferência Winograd) e XNLI (inferência multilíngue). Esse conjunto mede como os modelos processam e geram texto em espanhol em diferentes contextos e níveis de dificuldade.",
      "repository": "https://github.com/surus-lat/lm-evaluation-harness-surus",
      "subtasks": [
        "copa_es",
        "escola",
        "mgsm_direct_es_spanish_bench",
        "openbookqa_es",
        "paws_es_spanish_bench",
        "teleia_pce",
        "teleia_cervantes_ave",
        "teleia_siele",
        "wnli_es"
      ]
    },
    "translation": {
      "name": "Translation",
      "description": "Machine translation evaluation tasks",
      "description_en": "Machine translation evaluation tasks",
      "description_es": "Tareas de evaluación de traducción automática",
      "description_pt": "Tarefas de avaliação de tradução automática",
      "long_description": "Comprehensive machine translation evaluation suite combining FLORES+ and OPUS-100 datasets to assess multilingual translation capabilities. FLORES+ provides high-quality translations across Spanish, Portuguese, English, French, Italian, German, Hindi, Arabic and Chinese, covering 30 language pairs focused on Latin American and Iberian languages. OPUS-100 contributes English-Spanish and English-Portuguese translation pairs from a large-scale multilingual corpus. Both datasets evaluate translation quality using COMET, BLEU and chrF metrics, with COMET as the primary reported metric. This evaluation suite measures models' ability to accurately translate between languages while maintaining semantic meaning and linguistic fluency across diverse text domains.",
      "long_description_en": "Comprehensive machine translation evaluation suite combining FLORES+ and OPUS-100 datasets to assess multilingual translation capabilities. FLORES+ provides high-quality translations across Spanish, Portuguese, English, French, Italian, German, hindi, arabic and chinese, covering 30 language pairs focused on Latin American and Iberian languages. OPUS-100 contributes English-Spanish and English-Portuguese translation pairs from a large-scale multilingual corpus. Both datasets evaluate translation quality using COMET, BLEU and chrF metrics, with COMET as the primary reported metric. This evaluation suite measures models' ability to accurately translate between languages while maintaining semantic meaning and linguistic fluency across diverse text domains.",
      "long_description_es": "Suite integral de evaluación de traducción automática que combina los conjuntos de datos FLORES+ y OPUS-100 para evaluar capacidades de traducción multilingüe. FLORES+ proporciona traducciones de alta calidad entre español, portugués, inglés, francés, italiano, alemán, indio, arabe y chino, cubriendo 30 pares de idiomas enfocados en lenguas latinoamericanas e ibéricas. OPUS-100 aporta pares de traducción inglés-español e inglés-portugués de un corpus multilingüe a gran escala. Ambos conjuntos evalúan la calidad de traducción usando métricas COMET, BLEU y chrF, con COMET como métrica principal reportada. Esta suite mide la capacidad de los modelos para traducir con precisión entre idiomas manteniendo el significado semántico y la fluidez lingüística en diversos dominios textuales.",
      "long_description_pt": "Suíte abrangente de avaliação de tradução automática combinando os conjuntos FLORES+ e OPUS-100 para avaliar capacidades de tradução multilíngue. FLORES+ fornece traduções de alta qualidade entre espanhol, português, inglês, francês, italiano, alemão, indiano, árabe e chinês, cobrindo 30 pares de idiomas focados em línguas latino-americanas e ibéricas. OPUS-100 contribui com pares de tradução inglês-espanhol e inglês-português de um corpus multilíngue em larga escala. Ambos os conjuntos avaliam a qualidade da tradução usando métricas COMET, BLEU e chrF, com COMET como métrica principal reportada. Esta suíte mede a capacidade dos modelos de traduzir com precisão entre idiomas mantendo o significado semântico e a fluência linguística em diversos domínios textuais.",
      "repository": "https://github.com/surus-lat/lm-evaluation-harness-surus",
      "subtasks": [
        "opus",
        "flores"
      ]
    },
    "structured_extraction": {
      "name": "Structured Extraction",
      "description": "Structured data extraction from unstructured text",
      "description_en": "Structured data extraction from unstructured text",
      "description_es": "Extracción de datos estructurados de texto no estructurado",
      "description_pt": "Extração de dados estruturados de texto não estruturado",
      "long_description": "Comprehensive evaluation suite for AI systems' capabilities in extracting structured information from unstructured text and returning it in JSON format. This task group focuses on testing models' ability to parse diverse document types and extract all relevant information while adhering to provided JSON schemas. The evaluation covers multiple domains including medical records, e-commerce listings, business documents, travel itineraries, media content, technology specifications, and manufacturing reports. This benchmark assesses both comprehension accuracy and structured output generation capabilities, measuring how well language models can transform unstructured text into precise, schema-compliant JSON responses.",
      "long_description_en": "Comprehensive evaluation suite for AI systems' capabilities in extracting structured information from unstructured text and returning it in JSON format. This task group focuses on testing models' ability to parse diverse document types and extract all relevant information while adhering to provided JSON schemas. The evaluation covers multiple domains including medical records, e-commerce listings, business documents, travel itineraries, media content, technology specifications, and manufacturing reports. This benchmark assesses both comprehension accuracy and structured output generation capabilities, measuring how well language models can transform unstructured text into precise, schema-compliant JSON responses.",
      "long_description_es": "Suite integral de evaluación para las capacidades de los sistemas de IA en extraer información estructurada de texto no estructurado y devolverla en formato JSON. Este grupo de tareas se enfoca en probar la capacidad de los modelos para analizar diversos tipos de documentos y extraer toda la información relevante mientras se adhieren a esquemas JSON proporcionados. La evaluación cubre múltiples dominios incluyendo registros médicos, listados de comercio electrónico, documentos comerciales, itinerarios de viaje, contenido multimedia, especificaciones tecnológicas e informes de manufactura. Este benchmark evalúa tanto la precisión de comprensión como las capacidades de generación de salida estructurada, midiendo qué tan bien los modelos de lenguaje pueden transformar texto no estructurado en respuestas JSON precisas y compatibles con esquemas.",
      "long_description_pt": "Suíte abrangente de avaliação para as capacidades dos sistemas de IA em extrair informações estruturadas de texto não estruturado e retorná-las em formato JSON. Este grupo de tarefas foca em testar a capacidade dos modelos de analisar diversos tipos de documentos e extrair toda a informação relevante enquanto aderem a esquemas JSON fornecidos. A avaliação cobre múltiplos domínios incluindo registros médicos, listagens de e-commerce, documentos comerciais, itinerários de viagem, conteúdo de mídia, especificações tecnológicas e relatórios de manufatura. Este benchmark avalia tanto a precisão de compreensão quanto as capacidades de geração de saída estruturada, medindo quão bem os modelos de linguagem podem transformar texto não estruturado em respostas JSON precisas e compatíveis com esquemas.",
      "repository": "https://github.com/surus-lat/benchy",
      "subtasks": [
        "paraloq"
      ]
    },
    "image_extraction": {
      "name": "Image Extraction",
      "description": "Structured data extraction from document images",
      "description_en": "Structured data extraction from document images",
      "description_es": "Extracción de datos estructurados de imágenes de documentos",
      "description_pt": "Extração de dados estruturados de imagens de documentos",
      "long_description": "Evaluates vision-language models on structured data extraction from document images such as invoices, forms, receipts, and other business documents. Given an image and a JSON schema, the model must extract structured data that conforms to the schema. This task measures how accurately models can read and interpret visual documents, with particular emphasis on numeric accuracy for financial and business documents. The evaluation uses comprehensive metrics including document extraction score, field-level F1 scores, schema validity, and hallucination detection. The task supports dataset-specific configuration for normalization rules, field matching thresholds, and metric weights, allowing adaptation to different document types and extraction requirements.",
      "long_description_en": "Evaluates vision-language models on structured data extraction from document images such as invoices, forms, receipts, and other business documents. Given an image and a JSON schema, the model must extract structured data that conforms to the schema. This task measures how accurately models can read and interpret visual documents, with particular emphasis on numeric accuracy for financial and business documents. The evaluation uses comprehensive metrics including document extraction score, field-level F1 scores, schema validity, and hallucination detection. The task supports dataset-specific configuration for normalization rules, field matching thresholds, and metric weights, allowing adaptation to different document types and extraction requirements.",
      "long_description_es": "Evalúa modelos de visión-lenguaje en la extracción de datos estructurados de imágenes de documentos como facturas, formularios, recibos y otros documentos comerciales. Dada una imagen y un esquema JSON, el modelo debe extraer datos estructurados que se ajusten al esquema. Esta tarea mide qué tan precisamente los modelos pueden leer e interpretar documentos visuales, con énfasis particular en la precisión numérica para documentos financieros y comerciales. La evaluación utiliza métricas integrales que incluyen puntuación de extracción de documentos, puntuaciones F1 a nivel de campo, validez de esquema y detección de alucinaciones. La tarea admite configuración específica del conjunto de datos para reglas de normalización, umbrales de coincidencia de campos y pesos de métricas, permitiendo la adaptación a diferentes tipos de documentos y requisitos de extracción.",
      "long_description_pt": "Avalia modelos de visão-linguagem na extração de dados estruturados de imagens de documentos como faturas, formulários, recibos e outros documentos comerciais. Dada uma imagem e um esquema JSON, o modelo deve extrair dados estruturados que se ajustem ao esquema. Esta tarefa mede quão precisamente os modelos podem ler e interpretar documentos visuais, com ênfase particular na precisão numérica para documentos financeiros e comerciais. A avaliação utiliza métricas abrangentes incluindo pontuação de extração de documentos, pontuações F1 em nível de campo, validade de esquema e detecção de alucinações. A tarefa suporta configuração específica do conjunto de dados para regras de normalização, limites de correspondência de campos e pesos de métricas, permitindo adaptação a diferentes tipos de documentos e requisitos de extração.",
      "repository": "https://github.com/surus-lat/benchy",
      "subtasks": []
    }
  }
}
